[
    {
        "title": "Basic Rules And Terms",
        "isChild": false
        "rules": [
            "Server Rules:",
"Policy A: Basic Rules & Terms:",
            "• You must realistically roleplay at all times. Fail-RolePlay (FailRP), Power Gaming (PG), Random Deathmatches (RDM), Vehicle Deathmatches (VDM), Meta-Gaming, Noclipping, Teleporting, Godmode, Invisibility and/or any type of so-called “Trolling” will not be tolerated.",
            "• Do NOT intentionally bait Law Enforcement Officers, also known as Copbaiting; for example, do NOT try to intentionally get a Law Enforcement Officer to initiate a traffic stop on you.",
            "• Do NOT interfere with any roleplay that you are not apart of.",
            "• Do NOT perform any Erotic RP. This includes roleplay containing sexism and nudity.",
            "• Random Deathmatches (RDM), When you purposely kill someone without any initiation (saying something to the person) before you proceed to kill them. There must be an actual reason to initiate roleplay at all times.",
            "• Meta Gaming, When you use information from a person's live stream, YouTube video, or something someone told you out of character (OOC) in-game.",
            "• Power Gaming, Taking someone hostage and 'forcing' them to give you the money in their bank account or *If taken into police custody and are cuffed* Running to a garage and taking out a vehicle while cuffed.",
            "• Usage of /OOC chat in-game - Constant useless usage of the OOC (Out of Character) chat in-game is prohibited. Only use the OOC chat for current issues/bugs (falling through the floor and dying, no loot given in bank, etc.) and things that cannot be handled in the Discord.",
            "• Valuing your life - You must value your life at all costs, not valuing your life will have you sent to the Bahamas. (aka being punished)",
            "• Character Names - When creating your character, please be appropriate with names. Do not use celebrity names, or any names involved with violence in the real world.",
            "• You are allowed to Protest, but do not start protests of real-life events.",
            "• Do NOT interfere with any roleplay that you are not a part of.",
            "• Do NOT perform any Erotic RP.",
            "• Do NOT perform any roleplay that includes and/or contains racism, terrorism, etc.",
            "• Do NOT Combat Log, meaning do not leave during active scenes.",
            "• Armored or weaponized vehicles, explosive ammunition, or explosive weapons are NOT allowed, however, they have already been blacklisted, so this should not be a problem.",
            "• Do NOT perform any type of Military RP. This includes wearing any uniforms or clothing associated with the military.",
            "• Respect and treat everyone EQUALLY. This means to treat and respect both members and the staff team how you would like to be treated.",
            "• Do NOT Mini Mod, if you have an issue with someone you can report the person, do not handle it yourself. This includes abusing any available roleplay functions.",
            "• Character group limitations;", 
            "Law Enforcement:",
            "A. You cannot have two (2) characters that are a part of different law enforcement departments.",
            "B. You cannot have two (2) characters in the same law enforcement department.",
"Other Emergency Services:",
            "A. You cannot have one character in multiple Emergency Services positions.",
            "B. You can be in dispatch and another emergency service position.",
"Gangs/Criminal Groups:",
"A. You cannot have two (2) or more characters in the same gang/criminal group/organization.",
"B. If you perm-kill your character, you cannot join that same group/gang for six (6) months on a new character.",
"C. While in the commission of a crime, only six members of the group may be present during the crime.",
"'Families':",
           " a. You cannot make a whole family controlled by you, for instance, you cannot have this character be the brother, and another character that you own be another brother and/or cousin. All of your characters cannot have connections with each other, each one has a mind of its own.",
            
            "• If you're a part of any Emergency Services, and you end up resigning from your position, you need to wait 30 days before you can be considered for reinstatement.",
            "• If you discover a bug, do NOT abuse/exploit it as you will be severely punished. Instead, please file a bug report on the forums so we can fix it as soon as possible.",
            "• Do NOT have any inappropriate or NSFW profile pictures on our Discord and/or Forums.",
"We Strictly follow the Discord TOS and Guidelines! if you are found breaking either of these, you will be BANNED without notice!",
"TOS: https://discordapp.com/terms",
"Guidelines: https://discordapp.com/guidelines",


            "Policy B: Chain of Command (CoC)",
"• Everyone will start from the bottom and may be promoted to any position if necessary.",
"• Do NOT skip ranks.",
"• Do NOT ask for promotions/ranks.",
"• Directors/Administration always have the final say in any decision made.",

            "Policy C: Respect Staff and Their Decisions",
"• Staff Members always have the final say, no point in arguing a punishment. Instead, accept the consequences and if you still feel like it was treated poorly or you didn't do anything, fill out a Staff Report and appeal your punishment.",
"• Do NOT question decisions made by the Staff Team of TXDPSRP.",
"• If you believe there is a problem with the Staff Team of TXDPSRP, bring it up the CoC (Chain of Command), until it finally reaches the Head Administration.",
"• If you believe there is a problem with a specific staff member, fill out the Staff Report form located on our forums, and we will take care of the issue, if necessary.",
"• Always be honest with the Staff Team of TXDPSRP.",







            

    }
    {
        "title": "Forum Rules",
        "isChild": false,
        "rules": [
         "• Respect and treat everyone EQUALLY. This means to treat and respect both members and the staff team how you would like to be treated.",
         "• Maturity must be maintained at ALL TIMES.",
         "• Do not impersonate ANY other members on the Forums. This also applies to any known YouTubers/Celebrities. This falls under “Intentionally Deceiving,” and you can be punished for it.",
         " • Do not reply to ANY staff related questions. Wait until a staff member responds to that question.",
         "• If you believe a player has broken the rules, file a player report form located here, and our Reports Team will take care of the issue, if necessary.",
         "• If you believe a forum member has broken the rules, click the report button on the comment, and a staff member will take care of it, if necessary.",
         "• If you discover a bug, do NOT abuse/exploit it as you will be severely punished. Instead, please file a bug report here so we can fix it as soon as possible.",
         "• Do NOT have any inappropriate or NSFW profile pictures.",
         "• If you believe there is a problem with a specific staff member, fill out the Staff Report form located here, and we will take care of the issue, if necessary.",
         "• Do NOT make any false reports, such as player reports, staff reports or bug reports. This includes using false and/or fabricated evidence/information.",

         "(Rules about applications)",
         "• Do NOT ask department recruiters, department command staff or staff members to review your application.",
         "• Do NOT send an application to a department if you already have an application pending for that department.",
         "• Do NOT lie or make false statements in applications, such as lying about your age or previous TXDPSRP experience/history.",

            "Staff report: https://txnrp.com/r/staffReport",
            "Player report: https://txnrp.com/r/report",
            "Bug report: Link https://txnrp.com/r/bug",
            






            

    }
    {
        "title": "Discord Rules",
        "isChild": false,
        "rules": [
            "Text and Voice Channel(s)",
    "• Please try your best to help us to keep this Discord, a safe and friendly place to chat.",
    "• You are NOT ALLOWED to use inappropriate language that includes racism, sexism, or anything that is extremely offensive to specific groups of people. This can be in your status message, profile picture, all of the text chats, as well as all of the public voice channels.",
    "• People are allowed to use PG-13 Language in any public voice channels as long as (1) consist of 8 or less people and (2) everyone in that voice lobby is okay with it.",
    "• Do NOT try to bypass any bot filters.",
    "• Do NOT spam in any text channel.",
    "• Do NOT post inappropriate pictures if ever given the permission to post links/pictures.",
    "Respect",
    "• Respect and treat everyone EQUALLY. This means to treat and respect both members and the staff team how you would like to be treated.",
    "• Maturity must be used at ALL TIMES, even when a Staff Member is not in the channel.",
    "• Obey all staff members. If you feel like you are being treated unfairly by a staff member, please fill out a Staff Report on our forums. Do not complain about it in public.",
    "• Do not impersonate ANY other members on the Discord Server. This also applies to any known YouTubers/Celebrities. This falls under “Intentionally Deceiving,” and you can be punished for it.",
    "• Do NOT tag (using @ to ping or send a notification to a specific member) any staff members unless you have a valid reason to do so. Also, do not tag any specific users repeatedly.",
    "• It is under your discretion to share your own personal information with other members such as race, sex, sexual orientation, financial status, full names, addresses, IP’s, appearances, and voices. However, do NOT share others’ personal information, unless given permission.",
    "• For the sake of everyone, it is only fair and respectful that TXDPSRP is an ENGLISH only network. Please refrain from speaking any other languages than English in any text/voice channels.",
    "Advertising",
    "• Do NOT have a social media link, IP, or another FiveM server in your discord status message.",
    "• Do NOT advertise another server in our text/voice channels. You may advertise another server in Private Direct Messages, but ONLY IF THEY ASK FOR IT. Failure to follow this rule will result in a permanent ban.",
    "• Similarly, do not advertise your YouTube channel or Social Media to any users unless they ASK FOR IT.",
    "Notes",
    "Anything you say to users through private messages on any application can be punishable on the Discord Server as well. That includes harassment, unnecessary swearing, sending random links, etc. Message a staff member with solid evidence, such as screenshots, videos, etc, if you feel someone should be punished for something they said through Private Messages.",

    "We, The TXDPSRP Network also strictly follow the Discord Terms of Service (TOS) and their Guidelines! If you are found breaking either of these you will be BANNED without notice and/or explanation",
            






            

    }
    {
        "title": "Miscellaneous Rules",
        "isChild": false,
        "rules": [
     "• Do NOT sell or purchase anything of some sort that displays the TXDPSRP Logo, unless approved, distributed, and/or promoted by Head Administration.",
     "• Do NOT create any discord/teamspeak servers in the name of TXDPSRP, unless approved by the founder.",
     "•  Do NOT distribute any files or documents which may be harmful to a user.",
     " • Do NOT distribute or plagiarize any documents created within The TXDPSRP Network.",
     "• Do NOT create any official TXDPSRP social media accounts. This is handled by our Social Media Team.",
     "• Do NOT attempt to sell any in-game items for profit in real-life. ",
     "• Maturity must be maintained at ALL TIMES, even when a Staff Member is not in the channel.",






            


           
           

         

        ]
    }
]
